app/views/check/results.html.erb

INSERT INTO "removals" ("updated_at", "fb_id", "created_at") VALUES ('2011-10-01 04:41:23.208938', '1663350002', '2011-10-01 04:41:23.208938')
---

		<%= button_to('Click here if you would like to remove yourself', 'index',
						:method => Removal.create(:fb_id => URI.decode(@girl.username)), :remote => true,
															:id => 'remove-button') %>