app/controllers/check_controller.rb

SELECT "girls".* FROM "girls" WHERE ("girls"."username" = '1663350002') LIMIT 1
SELECT "guys".* FROM "guys" WHERE ("guys"."username" = '1663350002') LIMIT 1
---
  def test
    @fb =  params[:facebook]
    puts "Test initial: #{@fb}"

   @fb.sub!("http://", "")
   @fb.sub!("www.", "")
   @fb.sub!("facebook.com/profile.php?id=", "")
   @fb.sub!("facebook.com/", "")
    #@good = @id.chomp('http://www.facebook.com/')

   @girl = Girl.find_by_username(@fb)
   if @girl == nil
     @boy = Guys.find_by_username(@fb)