app/controllers/girls_controller.rb

  def update
     @win = Girl.find(params[:win])
---
SELECT "girls".* FROM "girls" WHERE ("girls"."id" = 2144) LIMIT 1

  def show
    @girl = Girl.find(params[:id])
---
SELECT "girls".* FROM "girls" WHERE ("girls"."id" = 1670) LIMIT 1