app/controllers/guys_controller.rb

  def update
    @win = Guys.find(params[:win])
---
SELECT "guys".* FROM "guys" WHERE ("guys"."id" = 631) LIMIT 1

  def show
    @guy = Guys.find(params[:id])
---
SELECT "guys".* FROM "guys" WHERE ("guys"."id" = 714) LIMIT 1