app/controllers/winners_controller.rb

  def index
    @title = "Winnders"
    #@girls = Girl.order('score DESC').limit(100).all
    @girls = Girl.paginate(:page => params[:girls_page]).limit(5).order('score DESC')
    @boys = Guys.paginate(:page => params[:boys_page]).limit(5).order('score DESC')
---
SELECT "girls".* FROM "girls" ORDER BY score DESC LIMIT 100 LIMIT 5 OFFSET 5
SELECT COUNT(*) FROM "girls"
SELECT "guys".* FROM "guys" ORDER BY score DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "guys"